from shared.enums import EUserStatus

status_translation = {
    EUserStatus.DEMO: "Демо",
    EUserStatus.UNLIMITED: "Необмежений",
    EUserStatus.MAX: "Максимальний",
    EUserStatus.ADMIN: "Адміністратор",
}

demo_names = [
    "Артем",
    "Дмитро",
    "Олександр",
    "Сергій",
    "Тетяна",
    "Олег",
    "Іван",
    "Максим",
    "Володимир",
    "Марія",
    "Ксенія",
    "Оксана",
    "Олена",
    "Ярослав",
    "Катерина",
    "Софія",
]

unlim_names = [
    "Артем",
    "Дмитро",
    "Олександр",
    "Сергій",
    "Тетяна",
    "Олег",
    "Іван",
    "Максим",
    "Володимир",
    "Марія",
    "Ксенія",
    "Оксана",
    "Олена",
    "Ярослав",
    "Катерина",
    "Софія",
]

max_names = [
    "Артем",
    "Дмитро",
    "Олександр",
    "Сергій",
    "Тетяна",
    "Олег",
    "Іван",
    "Максим",
    "Володимир",
    "Марія",
    "Ксенія",
    "Оксана",
    "Олена",
    "Ярослав",
    "Катерина",
    "Софія",
]

admin_names = [
    "Артем",
    "Дмитро",
    "Олександр",
    "Сергій",
    "Тетяна",
    "Олег",
    "Іван",
    "Максим",
    "Володимир",
    "Марія",
    "Ксенія",
    "Оксана",
    "Олена",
    "Ярослав",
    "Катерина",
    "Софія",
]

operators = {
    "Vodafone": ["50", "66", "99"],
    "Київстар": ["67", "68", "96", "97", "98"],
    "lifecell": ["63", "73", "93", "95"],
}
